# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]
fusion_mode: bifpn
node_mode: CFAtt
head_channel: 256


backbone:
  - [-1, 1, RCSPNet, ['C2f', [64, 128, 256, 512], [3, 6, 6, 3], 3]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [2, 1, Conv, [head_channel]]
  - [3, 1, Conv, [head_channel]]
  - [5, 1, Conv, [head_channel]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Fusion, [fusion_mode]]
  - [-1, 2, node_mode, [head_channel]]

  - [1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 6, 14], 1, Fusion, [fusion_mode]]
  - [-1, 2, node_mode, [head_channel]]

  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 7, 11], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel]]

  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 8], 1, Fusion, [fusion_mode]]
  - [-1, 2, node_mode, [head_channel]]

  - [[17, 20, 23], 1, Detect_DyHead, [nc, 128, 1]]